{
    "about": {
        "whoami": "WHOAMI",
        "my-name-is": "Mon nom est",
        "my-description": ", je suis un gamer depuis que je suis en âge de tenir une manette et développeur de jeux vidéo passionné, je suis reconnu pour ma grande capacité d'adaptation et d'apprentissage. Je travaille actuellement chez Gameloft Montréal en tant que développeur Back End. Je rêve d'obtenir un poste en programmation gameplay ou généraliste.",
        "skills": "COMPÉTENCES",
        "languages": "Langages:",
        "technologies": "Technologies:",
        "softwares": "Logiciels:"
    },
    "contact": {
        "contact-me": "CONTACT",
        "see-resume": "CV"
    },
    "home": {
        "hello-world": "Hello World!",
        "im": "Je suis",
        "developer": "un développeur de jeux vidéo." 
    },
    "places-worked": {
        "places-ive-worked": "ENDROITS OÙ J'AI TRAVAILLÉ",
        "gameloft": {
            "name": "Gameloft",
            "header": "Développeur Back End | Montréal (QC) | Mai 2022 - Présent",
            "task1": "Développer des microservices faits en Python utilisés par la majorité des jeux de la compagnie pour l'authentification, la progression des joueurs, le matchmaking et autres dans un environnement Agile Scrum.",
            "task2": "Optimiser et garantir une haute disponibilité des microservices avec AWS, Docker et Kubernetes, car ceux-ci doivent gérer plus de 10 milliards de requêtes par jour.",
            "task3": "Participer activement aux réponses aux incidents opérationnels, en aidant à dépanner et à résoudre tout problème en temps opportun."
        },
        "genetec": {
            "name": "Genetec",
            "header": "Développeur logiciel (stage) | Sherbrooke (QC) | Mai 2021 – Août 2021",
            "task1": "Rédiger avec C# et .NET un plugin permettant d’utiliser dans un logiciel de surveillance de bâtiments des cadenas intelligents et d’y gérer des contrôles d’accès dans un environnement Agile Kanban.",
            "task2": "Écrire des tests unitaires avec les frameworks NUnit et SpecFlow."
        },
        "nba": {
            "name": "NB Automation",
            "header": "Développeur Full Stack (stage) | Granby (QC) | Mai 2019 – Août 2019",
            "task1": "Ajouter et mettre à jour des formulaires dans un logiciel CRUD en utilisant C#, .NET et WPF servant à faire du contrôle de qualité sur des produits fabriqués en manufacture.",
            "task2": "Améliorer la conception d’une base de données SQL."
        }
    },
    "projects": {
        "my-projects": "MES PROJETS",
        "stepping-stones-description": "Nous sommes le 31 décembre 1999 quand le bug de l'an 2000 touche toutes l'humanité. Notre histoire à disparut. Vous devez courir à travers les age pour retrouver celle-ci et divers découverte pour ramener le cours de l'histoire. Fait avec Unreal Engine 5, C++, Blueprints et Wwise.",
        "sauve-chouris-description": "Sauve Chouris, ton ami qui est coincé dans le manoir de Mme Fauché! Vous allez devoir vous repérer avec votre pouvoir d'écholocalisation. Fait avec Unity, C# et Wwise.",
        "elemensions-description": "Dans ElemEnsions, vous incarnez Guerna la gobeline aventurière à la recherche d'un nouveau trésor. Afin de surmonter les nombreux obstacles des ruines, vous avez à votre disposition le pouvoir du pendentif de Portalite, artéfact trouvé lors d'une aventure passée, qui permet de changer d'une dimension élémentaire à une autre. Chaque élément a ses propriétés uniques:  Feu, Air, Eau, Terre. Fait avec Unity et C#.",
        "back-to-the-party-description": "Back to the Party est une expérience coopérative à 2 joueurs. Un joueur se trouve dans le passé et doit gérer un party à son appartement. Il doit satisfaire les besoins de ses invités afin de devenir leur ami. En satisfaisant ces besoins, on obtient les réponses pour l’examen futur. L'autre joueur se trouve dans le futur et doit répondre aux questions d'examen avec les réponses obtenues. Il doit aussi fournir des ressources au joueur du passé via un portail quantique. Fait avec Unity, C#, Blender et Fmod.",
        "purrfect-escape-description": "Dans Purrfect Escape, nous jouons le rôle d'un chat désireux de sortir pour satisfaire ses instincts de chasseur. Cependant, celui-ci est prisonnier de sa maison et ses humains ne le laissent pas sortir. Pourra-t-il trouver moyen de s'échapper? Fait avec Unity et C#.",
        "worfo-description": "World of Rune Fantasy Online est un jeu MMORPG en monde ouvert. Partez à l'aventure seul ou entre amis. Recherchez, combattez, explorez, améliorez vos compétences. Jouez à votre façon et façonnez votre destin! Fait avec Unity, C#, MySQL et Ink.",
        "download": "Télécharger"
    }
}
